NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/access.c
    /*lint -save -e64 -e446 Side effects and type mismatches in initializer */
    dsm_handle_t appkey_handle = dsm_appkey_handle_get(p_evt->secmat.p_app);
    access_message_rx_t message =
        {
            .opcode = opcode,
            .p_data = &p_evt->p_buffer[access_utils_opcode_size_get(opcode)],
            .length = p_evt->length - access_utils_opcode_size_get(opcode),
            .meta_data.src.type = p_evt->src.type,
            .meta_data.src.value = p_evt->src.value,
            .meta_data.src.p_virtual_uuid = p_evt->src.p_virtual_uuid,
            .meta_data.dst.type = p_evt->dst.type,
            .meta_data.dst.value = p_evt->dst.value,
            .meta_data.dst.p_virtual_uuid = p_evt->dst.p_virtual_uuid,
            .meta_data.timestamp = p_evt->p_metadata->params.scanner.timestamp,
            .meta_data.rssi = p_evt->p_metadata->params.scanner.rssi,
            .meta_data.ttl = p_evt->ttl,
            .meta_data.appkey_handle = appkey_handle
        };
    /*lint -restore */

    handle_incoming(&message);
}

static void mesh_evt_cb(const nrf_mesh_evt_t * p_evt)
{
    switch (p_evt->type)
    {
        case NRF_MESH_EVT_MESSAGE_RECEIVED:
            mesh_msg_handle(&p_evt->params.message);
            break;
        default:
            /* Ignore */
            break;
    }

}

static bool check_tx_params(access_model_handle_t handle, const access_message_tx_t * p_tx_message, const access_message_rx_t * p_rx_message, uint32_t * p_status)
{
    NRF_MESH_ASSERT(NULL != p_status);
    if (p_tx_message->length >= ACCESS_MESSAGE_LENGTH_MAX)
    {
        *p_status = NRF_ERROR_INVALID_LENGTH;
    }
    else if (!model_handle_valid_and_allocated(handle) ||
             m_model_pool[handle].model_info.element_index >= ACCESS_ELEMENT_COUNT)
    {
        *p_status = NRF_ERROR_NOT_FOUND;
    }
    else if ((p_rx_message == NULL &&
              (m_model_pool[handle].model_info.publish_appkey_handle  == DSM_HANDLE_INVALID ||
               m_model_pool[handle].model_info.publish_address_handle == DSM_HANDLE_INVALID)) ||
             !is_valid_opcode(p_tx_message->opcode))
    {
        *p_status = NRF_ERROR_INVALID_PARAM;
    }
    else
    {
        *p_status = NRF_SUCCESS;
    }

    return (NRF_SUCCESS == *p_status);
}

static uint32_t packet_tx(access_model_handle_t handle,
                          const access_message_tx_t * p_tx_message,
                          const access_message_rx_t * p_rx_message)
{
    uint32_t status;
    if (!check_tx_params(handle, p_tx_message, p_rx_message, &status))
    {
        return status;
    }

    dsm_local_unicast_address_t local_addresses;
    dsm_local_unicast_addresses_get(&local_addresses);
    if (local_addresses.count <= m_model_pool[handle].model_info.element_index)
    {
        return NRF_ERROR_INVALID_ADDR;
    }

    uint16_t src_address = local_addresses.address_start + m_model_pool[handle].model_info.element_index;

    nrf_mesh_address_t dst_address;
    dsm_handle_t appkey_handle, publish_handle;
    if (p_rx_message != NULL)
    {
        appkey_handle = p_rx_message->meta_data.appkey_handle;
        dst_address = p_rx_message->meta_data.src;
        if (dsm_address_handle_get(&p_rx_message->meta_data.src, &publish_handle) != NRF_SUCCESS)
        {
            publish_handle = DSM_HANDLE_INVALID;
        }
    }
    else
    {
        appkey_handle = m_model_pool[handle].model_info.publish_appkey_handle;
        publish_handle = m_model_pool[handle].model_info.publish_address_handle;
        NRF_MESH_ERROR_CHECK(dsm_address_get(m_model_pool[handle].model_info.publish_address_handle, &dst_address));
    }

    uint8_t ttl;
    if (m_model_pool[handle].model_info.publish_ttl == ACCESS_TTL_USE_DEFAULT)
    {
        ttl = m_default_ttl;
    }
    else
    {
        ttl = m_model_pool[handle].model_info.publish_ttl;
    }

    /* Check if we are sending a message to one of our own addresses: */
    bool loopback_packet = (dst_address.type == NRF_MESH_ADDRESS_TYPE_UNICAST
            && dst_address.value >= local_addresses.address_start
            && dst_address.value < local_addresses.address_start + local_addresses.count)
        || (dst_address.type != NRF_MESH_ADDRESS_TYPE_UNICAST
                && publish_handle != DSM_HANDLE_INVALID
                && dsm_address_subscription_get(publish_handle));

    if (loopback_packet)
    {
        const access_message_rx_t rx_message =
        {
            .opcode = p_tx_message->opcode,  /*lint !e64 Type mismatch */
            .p_data = p_tx_message->p_buffer,
            .length = p_tx_message->length,
            .meta_data =
            {
                .src = { NRF_MESH_ADDRESS_TYPE_UNICAST, src_address },
                .dst = dst_address, /*lint !e64 Type mismatch */
                .timestamp = timer_now(), /*lint !e446 Initializer with side effect */
                .ttl = ttl,
                .appkey_handle = appkey_handle
            }
        };

        handle_incoming(&rx_message);
        status = NRF_SUCCESS;
    }

    if (!loopback_packet || (dst_address.type != NRF_MESH_ADDRESS_TYPE_UNICAST))
    {
        nrf_mesh_tx_params_t tx_params;
        memset(&tx_params, 0, sizeof(tx_params));
        uint8_t p_data[p_tx_message->length + access_utils_opcode_size_get(p_tx_message->opcode)];

        NRF_MESH_ERROR_CHECK(dsm_tx_secmat_get(appkey_handle, &tx_params.security_material));

        tx_params.dst = dst_address;
        tx_params.src = src_address;
        tx_params.ttl = ttl;
        tx_params.p_data = p_data;
        tx_params.data_len = p_tx_message->length + access_utils_opcode_size_get(p_tx_message->opcode);
        tx_params.tx_token = p_tx_message->access_token;

        opcode_set(p_tx_message->opcode, p_data);
        memcpy(&p_data[access_utils_opcode_size_get(p_tx_message->opcode)], p_tx_message->p_buffer, p_tx_message->length);

        status = nrf_mesh_packet_send(&tx_params, NULL);
        if (status == NRF_SUCCESS)
        {
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "TX: [aop: 0x%04x]\n", p_tx_message->opcode.opcode);
        }
    }

